ThomasQi3141/doom-on-htn-badge/firmware/doom/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# UART0's pins drive the button shift register, so USB Serial/JTAG is the only
# console this board has.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Every byte counts: the heap's largest contiguous block is only 188 KB.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
